Autodesk.Revit.DB.Analysis.AnalysisResultSchema.GetUnitsMultiplier(System.Int32)
returns units multiplier by index
index:
index of unit in the list
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.GetUnitsName(System.Int32)
returns units name by index
index:
index of unit in the list
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.GetNumberOfUnits
returns number of possible units
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.SetUnits(System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.Double})
Sets names and multipliers of all units for result visualization
names:
Unit names for all units (e.g., "Lb" and "Kg")
multipliers:
Numerical coefficients mapped to unit names.
They adjust measurement values shown in the legend and display (e.g., 1.0 and 0.451 - if actual measurements are in Lb)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
names is zero-length or contains duplicate or empty names
-or-
multipliers contains non-positive numbers, or its length is not equal to the length of names
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisResultSchema)
Determines if the input object is equivalent to this AnalysisResultSchema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Scale
Multiplier used for displaying diagram or vector values in view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: scale is zero or negative
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.CurrentUnits
Stores the index in the array of applicable units
Remarks:
Must be between 0 and (number of applicable units - 1)
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: currentUnits is not in the range from 0 to (number of applicable units - 1)
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsVisible
If true analysis result is visible in view
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.AnalysisDisplayStyleId
ElementId of analysis display style overriding the style set for view; -1 if the style is not overridden
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Description
Description of analysis result in view
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Name
Name of analysis result in view
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.#ctor(System.String,System.String)
Creates object and assigns name and description
name:
Name of the result schema
description:
Description of the result schema
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.#ctor(Autodesk.Revit.DB.Analysis.AnalysisResultSchema)
Constructs a new copy of the input AnalysisResultSchema object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema
Contains all information about one analysis result. Each result may contain several measurements.
Remarks:
In order to take effect, the AnalysisResultSchema object has to be registered by calling SpatialFieldManager::RegisterResult, which returns result index for future references;
to make changes to the properties of an already registered object, use method SpatialFieldManager::SetResultSchema and supply result index and replacing object.
Since:
2012